MikroElektronika/core_packages/ARM/gcc_clang/def/renesas/R7FA2L2074CNH/mcu.h
/* ==========================================================  TCC  ========================================================== */
 #define R_USBCC_TCC_RESET_Pos               (31UL)         /*!< RESET (Bit 31)                                        */
 #define R_USBCC_TCC_RESET_Msk               (0x80000000UL) /*!< RESET (Bitfield-Mask: 0x01)                           */
/* ==========================================================  MEC  ========================================================== */
 #define R_USBCC_MEC_MODE_Pos                (0UL)          /*!< MODE (Bit 0)                                          */
 #define R_USBCC_MEC_MODE_Msk                (0x1UL)        /*!< MODE (Bitfield-Mask: 0x01)                            */
 #define R_USBCC_MEC_PMODE_Pos               (1UL)          /*!< PMODE (Bit 1)                                         */
 #define R_USBCC_MEC_PMODE_Msk               (0x6UL)        /*!< PMODE (Bitfield-Mask: 0x03)                           */
 #define R_USBCC_MEC_GD_Pos                  (16UL)         /*!< GD (Bit 16)                                           */
 #define R_USBCC_MEC_GD_Msk                  (0x10000UL)    /*!< GD (Bitfield-Mask: 0x01)                              */
 #define R_USBCC_MEC_GUS_Pos                 (17UL)         /*!< GUS (Bit 17)                                          */
 #define R_USBCC_MEC_GUS_Msk                 (0x20000UL)    /*!< GUS (Bitfield-Mask: 0x01)                             */
/* ==========================================================  CCC  ========================================================== */
 #define R_USBCC_CCC_RD_Pos                  (0UL)          /*!< RD (Bit 0)                                            */
 #define R_USBCC_CCC_RD_Msk                  (0x1UL)        /*!< RD (Bitfield-Mask: 0x01)                              */
 #define R_USBCC_CCC_ZOPEN_Pos               (1UL)          /*!< ZOPEN (Bit 1)                                         */
 #define R_USBCC_CCC_ZOPEN_Msk               (0x2UL)        /*!< ZOPEN (Bitfield-Mask: 0x01)                           */
 #define R_USBCC_CCC_CCSEL_Pos               (8UL)          /*!< CCSEL (Bit 8)                                         */
 #define R_USBCC_CCC_CCSEL_Msk               (0x100UL)      /*!< CCSEL (Bitfield-Mask: 0x01)                           */
 #define R_USBCC_CCC_PDOWN_Pos               (31UL)         /*!< PDOWN (Bit 31)                                        */
 #define R_USBCC_CCC_PDOWN_Msk               (0x80000000UL) /*!< PDOWN (Bitfield-Mask: 0x01)                           */
/* ==========================================================  IES  ========================================================== */
 #define R_USBCC_IES_ISCN_Pos                (0UL)          /*!< ISCN (Bit 0)                                          */
 #define R_USBCC_IES_ISCN_Msk                (0x1UL)        /*!< ISCN (Bitfield-Mask: 0x01)                            */
 #define R_USBCC_IES_ISCC_Pos                (4UL)          /*!< ISCC (Bit 4)                                          */
 #define R_USBCC_IES_ISCC_Msk                (0x10UL)       /*!< ISCC (Bitfield-Mask: 0x01)                            */
 #define R_USBCC_IES_ISVBUS_Pos              (5UL)          /*!< ISVBUS (Bit 5)                                        */
 #define R_USBCC_IES_ISVBUS_Msk              (0x20UL)       /*!< ISVBUS (Bitfield-Mask: 0x01)                          */
 #define R_USBCC_IES_ISVRA_Pos               (15UL)         /*!< ISVRA (Bit 15)                                        */
 #define R_USBCC_IES_ISVRA_Msk               (0x8000UL)     /*!< ISVRA (Bitfield-Mask: 0x01)                           */
 #define R_USBCC_IES_CIEN_Pos                (16UL)         /*!< CIEN (Bit 16)                                         */
 #define R_USBCC_IES_CIEN_Msk                (0x10000UL)    /*!< CIEN (Bitfield-Mask: 0x01)                            */
 #define R_USBCC_IES_CCIEN_Pos               (20UL)         /*!< CCIEN (Bit 20)                                        */
 #define R_USBCC_IES_CCIEN_Msk               (0x100000UL)   /*!< CCIEN (Bitfield-Mask: 0x01)                           */
 #define R_USBCC_IES_VBUSIEN_Pos             (21UL)         /*!< VBUSIEN (Bit 21)                                      */
 #define R_USBCC_IES_VBUSIEN_Msk             (0x200000UL)   /*!< VBUSIEN (Bitfield-Mask: 0x01)                         */
 #define R_USBCC_IES_VRAIEN_Pos              (31UL)         /*!< VRAIEN (Bit 31)                                       */
 #define R_USBCC_IES_VRAIEN_Msk              (0x80000000UL) /*!< VRAIEN (Bitfield-Mask: 0x01)                          */
/* ==========================================================  TCS  ========================================================== */
 #define R_USBCC_TCS_SRCD_Pos                (0UL)          /*!< SRCD (Bit 0)                                          */
 #define R_USBCC_TCS_SRCD_Msk                (0x1UL)        /*!< SRCD (Bitfield-Mask: 0x01)                            */
 #define R_USBCC_TCS_VRD15D_Pos              (1UL)          /*!< VRD15D (Bit 1)                                        */
 #define R_USBCC_TCS_VRD15D_Msk              (0x2UL)        /*!< VRD15D (Bitfield-Mask: 0x01)                          */
 #define R_USBCC_TCS_VRD30D_Pos              (2UL)          /*!< VRD30D (Bit 2)                                        */
 #define R_USBCC_TCS_VRD30D_Msk              (0x4UL)        /*!< VRD30D (Bitfield-Mask: 0x01)                          */
 #define R_USBCC_TCS_PLUG_Pos                (3UL)          /*!< PLUG (Bit 3)                                          */
 #define R_USBCC_TCS_PLUG_Msk                (0x8UL)        /*!< PLUG (Bitfield-Mask: 0x01)                            */
 #define R_USBCC_TCS_CNS_Pos                 (4UL)          /*!< CNS (Bit 4)                                           */
 #define R_USBCC_TCS_CNS_Msk                 (0xf0UL)       /*!< CNS (Bitfield-Mask: 0x0f)                             */
 #define R_USBCC_TCS_CC1S_Pos                (8UL)          /*!< CC1S (Bit 8)                                          */
 #define R_USBCC_TCS_CC1S_Msk                (0x300UL)      /*!< CC1S (Bitfield-Mask: 0x03)                            */
 #define R_USBCC_TCS_CC2S_Pos                (10UL)         /*!< CC2S (Bit 10)                                         */
 #define R_USBCC_TCS_CC2S_Msk                (0xc00UL)      /*!< CC2S (Bitfield-Mask: 0x03)                            */
 #define R_USBCC_TCS_VBUSS_Pos               (12UL)         /*!< VBUSS (Bit 12)                                        */
 #define R_USBCC_TCS_VBUSS_Msk               (0x1000UL)     /*!< VBUSS (Bitfield-Mask: 0x01)                           */
/* =========================================================  TSET  ========================================================== */
 #define R_USBCC_TSET_CC_DEBOUNCE_Pos        (0UL)          /*!< CC_DEBOUNCE (Bit 0)                                   */
 #define R_USBCC_TSET_CC_DEBOUNCE_Msk        (0xffUL)       /*!< CC_DEBOUNCE (Bitfield-Mask: 0xff)                     */
 #define R_USBCC_TSET_PD_DEBOUNCE_Pos        (8UL)          /*!< PD_DEBOUNCE (Bit 8)                                   */
 #define R_USBCC_TSET_PD_DEBOUNCE_Msk        (0xff00UL)     /*!< PD_DEBOUNCE (Bitfield-Mask: 0xff)                     */
 #define R_USBCC_TSET_RP_VALUE_CHANGE_Pos    (16UL)         /*!< RP_VALUE_CHANGE (Bit 16)                              */
 #define R_USBCC_TSET_RP_VALUE_CHANGE_Msk    (0xff0000UL)   /*!< RP_VALUE_CHANGE (Bitfield-Mask: 0xff)                 */

/* =========================================================================================================================== */
/* ================                                         R_UARTA0                                          ================ */
/* =========================================================================================================================== */

/* =========================================================  TXBAn  ========================================================= */
/* =========================================================  RXBAn  ========================================================= */
/* ========================================================  ASIMAn0  ======================================================== */
 #define R_UARTA0_ASIMAn0_ISRMA_Pos    (0UL)    /*!< ISRMA (Bit 0)                                         */
 #define R_UARTA0_ASIMAn0_ISRMA_Msk    (0x1UL)  /*!< ISRMA (Bitfield-Mask: 0x01)                           */
 #define R_UARTA0_ASIMAn0_ISSMA_Pos    (1UL)    /*!< ISSMA (Bit 1)                                         */
 #define R_UARTA0_ASIMAn0_ISSMA_Msk    (0x2UL)  /*!< ISSMA (Bitfield-Mask: 0x01)                           */
 #define R_UARTA0_ASIMAn0_RXEA_Pos     (5UL)    /*!< RXEA (Bit 5)                                          */
 #define R_UARTA0_ASIMAn0_RXEA_Msk     (0x20UL) /*!< RXEA (Bitfield-Mask: 0x01)                            */
 #define R_UARTA0_ASIMAn0_TXEA_Pos     (6UL)    /*!< TXEA (Bit 6)                                          */
 #define R_UARTA0_ASIMAn0_TXEA_Msk     (0x40UL) /*!< TXEA (Bitfield-Mask: 0x01)                            */
 #define R_UARTA0_ASIMAn0_EN_Pos       (7UL)    /*!< EN (Bit 7)                                            */
 #define R_UARTA0_ASIMAn0_EN_Msk       (0x80UL) /*!< EN (Bitfield-Mask: 0x01)                              */
/* ========================================================  ASIMAn1  ======================================================== */
 #define R_UARTA0_ASIMAn1_ALV_Pos      (0UL)    /*!< ALV (Bit 0)                                           */
 #define R_UARTA0_ASIMAn1_ALV_Msk      (0x1UL)  /*!< ALV (Bitfield-Mask: 0x01)                             */
 #define R_UARTA0_ASIMAn1_DIR_Pos      (1UL)    /*!< DIR (Bit 1)                                           */
 #define R_UARTA0_ASIMAn1_DIR_Msk      (0x2UL)  /*!< DIR (Bitfield-Mask: 0x01)                             */
 #define R_UARTA0_ASIMAn1_SL_Pos       (2UL)    /*!< SL (Bit 2)                                            */
 #define R_UARTA0_ASIMAn1_SL_Msk       (0x4UL)  /*!< SL (Bitfield-Mask: 0x01)                              */
 #define R_UARTA0_ASIMAn1_CL_Pos       (3UL)    /*!< CL (Bit 3)                                            */
 #define R_UARTA0_ASIMAn1_CL_Msk       (0x18UL) /*!< CL (Bitfield-Mask: 0x03)                              */
 #define R_UARTA0_ASIMAn1_PS_Pos       (5UL)    /*!< PS (Bit 5)                                            */
 #define R_UARTA0_ASIMAn1_PS_Msk       (0x60UL) /*!< PS (Bitfield-Mask: 0x03)                              */
/* ========================================================  BRGCAn  ========================================================= */
/* ========================================================  ASISAn  ========================================================= */
 #define R_UARTA0_ASISAn_OVEA_Pos      (0UL)    /*!< OVEA (Bit 0)                                          */
 #define R_UARTA0_ASISAn_OVEA_Msk      (0x1UL)  /*!< OVEA (Bitfield-Mask: 0x01)                            */
 #define R_UARTA0_ASISAn_FEA_Pos       (1UL)    /*!< FEA (Bit 1)                                           */
 #define R_UARTA0_ASISAn_FEA_Msk       (0x2UL)  /*!< FEA (Bitfield-Mask: 0x01)                             */
 #define R_UARTA0_ASISAn_PEA_Pos       (2UL)    /*!< PEA (Bit 2)                                           */
 #define R_UARTA0_ASISAn_PEA_Msk       (0x4UL)  /*!< PEA (Bitfield-Mask: 0x01)                             */
 #define R_UARTA0_ASISAn_TXSFA_Pos     (4UL)    /*!< TXSFA (Bit 4)                                         */
 #define R_UARTA0_ASISAn_TXSFA_Msk     (0x10UL) /*!< TXSFA (Bitfield-Mask: 0x01)                           */
 #define R_UARTA0_ASISAn_TXBFA_Pos     (5UL)    /*!< TXBFA (Bit 5)                                         */
 #define R_UARTA0_ASISAn_TXBFA_Msk     (0x20UL) /*!< TXBFA (Bitfield-Mask: 0x01)                           */
/* ========================================================  ASCTAn  ========================================================= */
 #define R_UARTA0_ASCTAn_OVECTA_Pos    (0UL)    /*!< OVECTA (Bit 0)                                        */
 #define R_UARTA0_ASCTAn_OVECTA_Msk    (0x1UL)  /*!< OVECTA (Bitfield-Mask: 0x01)                          */
 #define R_UARTA0_ASCTAn_FECTA_Pos     (1UL)    /*!< FECTA (Bit 1)                                         */
 #define R_UARTA0_ASCTAn_FECTA_Msk     (0x2UL)  /*!< FECTA (Bitfield-Mask: 0x01)                           */
 #define R_UARTA0_ASCTAn_PECTA_Pos     (2UL)    /*!< PECTA (Bit 2)                                         */
 #define R_UARTA0_ASCTAn_PECTA_Msk     (0x4UL)  /*!< PECTA (Bitfield-Mask: 0x01)                           */

/* =========================================================================================================================== */
/* ================                                        R_UARTA_CK                                         ================ */
/* =========================================================================================================================== */

/* ========================================================  UTAnCK  ========================================================= */
 #define R_UARTA_CK_UTAnCK_CK_Pos     (0UL)    /*!< CK (Bit 0)                                            */
 #define R_UARTA_CK_UTAnCK_CK_Msk     (0xfUL)  /*!< CK (Bitfield-Mask: 0x0f)                              */
 #define R_UARTA_CK_UTAnCK_SEL_Pos    (4UL)    /*!< SEL (Bit 4)                                           */
 #define R_UARTA_CK_UTAnCK_SEL_Msk    (0x30UL) /*!< SEL (Bitfield-Mask: 0x03)                             */
 #define R_UARTA_CK_UTAnCK_EN_Pos     (7UL)    /*!< EN (Bit 7)                                            */
 #define R_UARTA_CK_UTAnCK_EN_Msk     (0x80UL) /*!< EN (Bitfield-Mask: 0x01)                              */

/* =========================================================================================================================== */
/* ================                                           R_WDT                                           ================ */
/* =========================================================================================================================== */

/* =========================================================  WDTRR  ========================================================= */
 #define R_WDT_WDTRR_WDTRR_Pos        (0UL)      /*!< WDTRR (Bit 0)                                         */
 #define R_WDT_WDTRR_WDTRR_Msk        (0xffUL)   /*!< WDTRR (Bitfield-Mask: 0xff)                           */
/* =========================================================  WDTCR  ========================================================= */
 #define R_WDT_WDTCR_RPSS_Pos         (12UL)     /*!< RPSS (Bit 12)                                         */
 #define R_WDT_WDTCR_RPSS_Msk         (0x3000UL) /*!< RPSS (Bitfield-Mask: 0x03)                            */
 #define R_WDT_WDTCR_RPES_Pos         (8UL)      /*!< RPES (Bit 8)                                          */
 #define R_WDT_WDTCR_RPES_Msk         (0x300UL)  /*!< RPES (Bitfield-Mask: 0x03)                            */
 #define R_WDT_WDTCR_CKS_Pos          (4UL)      /*!< CKS (Bit 4)                                           */
 #define R_WDT_WDTCR_CKS_Msk          (0xf0UL)   /*!< CKS (Bitfield-Mask: 0x0f)                             */
 #define R_WDT_WDTCR_TOPS_Pos         (0UL)      /*!< TOPS (Bit 0)                                          */
 #define R_WDT_WDTCR_TOPS_Msk         (0x3UL)    /*!< TOPS (Bitfield-Mask: 0x03)                            */
/* =========================================================  WDTSR  ========================================================= */
 #define R_WDT_WDTSR_REFEF_Pos        (15UL)     /*!< REFEF (Bit 15)                                        */
 #define R_WDT_WDTSR_REFEF_Msk        (0x8000UL) /*!< REFEF (Bitfield-Mask: 0x01)                           */
 #define R_WDT_WDTSR_UNDFF_Pos        (14UL)     /*!< UNDFF (Bit 14)                                        */
 #define R_WDT_WDTSR_UNDFF_Msk        (0x4000UL) /*!< UNDFF (Bitfield-Mask: 0x01)                           */
 #define R_WDT_WDTSR_CNTVAL_Pos       (0UL)      /*!< CNTVAL (Bit 0)                                        */
 #define R_WDT_WDTSR_CNTVAL_Msk       (0x3fffUL) /*!< CNTVAL (Bitfield-Mask: 0x3fff)                        */
/* ========================================================  WDTRCR  ========================================================= */
 #define R_WDT_WDTRCR_RSTIRQS_Pos     (7UL)      /*!< RSTIRQS (Bit 7)                                       */
 #define R_WDT_WDTRCR_RSTIRQS_Msk     (0x80UL)   /*!< RSTIRQS (Bitfield-Mask: 0x01)                         */
/* =======================================================  WDTCSTPR  ======================================================== */
 #define R_WDT_WDTCSTPR_SLCSTP_Pos    (7UL)      /*!< SLCSTP (Bit 7)                                        */
 #define R_WDT_WDTCSTPR_SLCSTP_Msk    (0x80UL)   /*!< SLCSTP (Bitfield-Mask: 0x01)                          */

/* =========================================================================================================================== */
/* ================                                          R_AGTX0                                          ================ */
/* =========================================================================================================================== */

/** @} */ /* End of group PosMask_peripherals */

 #ifdef __cplusplus
}
 #endif

#endif                                 /* R7FA2L209_H */

/** @} */ /* End of group R7FA2L209 */

/** @} */ /* End of group Renesas Electronics Corporation */
